<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Matlab with mpm

This recipe supports two architecture values:
	- x86_64
	- arm64</string>
	<key>Identifier</key>
	<string>local.download.matlab</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>Matlab</string>
		<key>app_path</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
